# 基础

## DataFrame

### Series

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj = Series([4, 7, -5, 3])
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [3]:
obj2=Series([4,7,-5,3],index=['d','b','a','c'])
print(obj2)

d    4
b    7
a   -5
c    3
dtype: int64

In [4]:
obj2['a']
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [5]:
#指标是对象的情形
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
'b' in obj2#可以查找

True

In [7]:
sdata={'jerrt':4.3,'marry':0.3,'tom':0.7}
obj3=Series(sdata)
obj3

jerrt    4.3
marry    0.3
tom      0.7
dtype: float64

In [8]:
names=['jerrt','marry','hello']
obj4=Series(sdata,index=names)
obj4

jerrt    4.3
marry    0.3
hello    NaN
dtype: float64

### 元素的属性

In [9]:
print(pd.isnull(obj4))
print(pd.isnull(obj3))
print(obj4.isnull())

jerrt    False
marry    False
hello     True
dtype: bool
jerrt    False
marry    False
tom      False
dtype: bool
jerrt    False
marry    False
hello     True
dtype: bool

In [10]:
obj3+obj4

hello    NaN
jerrt    8.6
marry    0.6
tom      NaN
dtype: float64

In [33]:
#名字是一个重要的属性
obj4.name='scores'
obj4.index.name='names'
obj4

names
1    4.3
2    0.3
3    NaN
Name: scores, dtype: float64

### DataFrame

In [52]:
data={'state':['Gansu','Anhui','Hefie','Riben'],'year':[2001,2002,2003,2004],'pop':[1.5,1.7,1.3,0.5]}
frame=DataFrame(data,columns=['year','state','pop','popp'],index=['one','two','three','four'])
frame2=DataFrame(data,columns=['year','state','pop','popp'])

In [53]:
frame
#如果传入未知参数则产生NAN

       year  state  pop popp
one    2001  Gansu  1.5  NaN
two    2002  Anhui  1.7  NaN
three  2003  Hefie  1.3  NaN
four   2004  Riben  0.5  NaN

In [60]:
#获取列
frame['year']
#结果是一个series

one      2001
two      2002
three    2003
four     2004
Name: year, dtype: int64

In [69]:
#获取行
#这里用方括号很奇怪
print(frame.loc['two'])#有索引就用索引，没有就用自带的
frame2.loc[3]
#结果也是一个Series

year      2002
state    Anhui
pop        1.7
popp        -1
Name: two, dtype: object

year      2004
state    Riben
pop        0.5
popp       NaN
Name: 3, dtype: object

### 修改一列的值

In [61]:
frame['popp']=100#标量可扩展
frame

       year  state  pop  popp
one    2001  Gansu  1.5   100
two    2002  Anhui  1.7   100
three  2003  Hefie  1.3   100
four   2004  Riben  0.5   100

In [63]:
import numpy as np
frame['popp']=np.linspace(1,5,4)#如果是列表则必须等长
frame

       year  state  pop      popp
one    2001  Gansu  1.5  1.000000
two    2002  Anhui  1.7  2.333333
three  2003  Hefie  1.3  3.666667
four   2004  Riben  0.5  5.000000

In [65]:
val=Series([-1,2],index=["two","three"])#如果是Series就不必
frame['popp']=val
frame

       year  state  pop  popp
one    2001  Gansu  1.5   NaN
two    2002  Anhui  1.7  -1.0
three  2003  Hefie  1.3   2.0
four   2004  Riben  0.5   NaN

### 添加与删除列

In [78]:
#添加一列
frame['mis']=frame['state']=='Gansu'
frame

       year  state  pop  popp    mis
one    2001  Gansu  1.5   NaN   True
two    2002  Anhui  1.7  -1.0  False
three  2003  Hefie  1.3   2.0  False
four   2004  Riben  0.5   NaN  False

In [79]:
del frame['mis']